IRP/src/InformationRegisters/SystemAttributes/SystemAttributes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>SystemAttributes</name>
 <resources>
  <name>Value</name>
  <type>
   <types>Characteristic.SystemAttributes</types>
  </type>
 </resources>
 <dimensions>
  <name>Object</name>
  <type>
   <types>DocumentRef</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Property</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.SystemAttributes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>1</precision>
   </numberQualifiers>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Catalogs/SystemAttributesSets/SystemAttributesSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SystemAttributesSets</name>
  <predefined>
    <items>
      <name>Document_SalesOrder</name>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
    </items>
    <items>
      <name>Document_SalesReturnOrder</name>
    </items>
    <items>
      <name>Document_SalesReturn</name>
    </items>
    <items>
      <name>Document_ShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
    </items>
    <items>
      <name>Document_PurchaseInvoice</name>
    </items>
    <items>
      <name>Document_PurchaseReturn</name>
    </items>
    <items>
      <name>Document_PurchaseReturnOrder</name>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
    </items>
    <items>
      <name>Document_RetailGoodsReceipt</name>
    </items>
    <items>
      <name>Document_RetailReceiptCorrection</name>
    </items>
    <items>
      <name>Document_RetailReturnReceipt</name>
    </items>
    <items>
      <name>Document_RetailSalesReceipt</name>
    </items>
    <items>
      <name>Document_RetailShipmentConfirmation</name>
    </items>
    <items>
      <name>Document_PurchaseOrderClosing</name>
    </items>
    <items>
      <name>Document_SalesOrderClosing</name>
    </items>
    <items>
      <name>Document_CommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_DecommissioningOfFixedAsset</name>
    </items>
    <items>
      <name>Document_ModernizationOfFixedAsset</name>
    </items>
    <items>
      <name>Document_ShipmentPlaningOrder</name>
    </items>
    <items>
      <name>Document_PlannedReceiptReservation</name>
    </items>
  </predefined>
  <tabularSections>
    <name>Attributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.SystemAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Collection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/SystemAttributesServer/Module.bsl
Procedure OnWrite_SystemAttributesOnWrite(Source, Cancel) Export
	SetPrivilegedMode(True);
		
	ArrayOfAttributes = GetSystemAttributes(Source.Metadata().FullName());
	
	RecordSet = InformationRegisters.SystemAttributes.CreateRecordSet();
	RecordSet.Filter.Object.Set(Source.Ref);
	
	For Each Attr In ArrayOfAttributes Do
		Values = Documents[Source.Metadata().Name].GetSystemAttributeValues(Source, Attr);
		
		If Values = Undefined Then
			Continue;
		EndIf;
		
		ValueTable = New ValueTable();
		ValueTable.Columns.Add("Value");
		For Each Value In Values Do
			ValueTable.Add().Value = Value;
		EndDo;
		ValueTable.GroupBy("Value");
		
		LineNumber = 1;
		For Each TableRow In ValueTable Do
			If Not ValueIsFilled(TableRow.Value) Then
				Continue;
			EndIf;
			Record = RecordSet.Add();
			Record.Object = Source.Ref;
			Record.Property = Attr;
			Record.Key = LineNumber;
			Record.Value = TableRow.Value;
			LineNumber = LineNumber + 1;
		EndDo;

	EndDo;
	
	RecordSet.AdditionalProperties.Insert("SystemRecord", True);
	RecordSet.Write();
EndProcedure

Procedure OutputSystemAttributes(Form, PlaceInFront = "", ListName = "List") Export
	ArrayOfSystemAttributes = GetSystemAttributes(Form[ListName].MainTable);
	For Each Attr In ArrayOfSystemAttributes Do
		AttrPresentation = String(Attr); 
		If ValueIsFilled(PlaceInFront) Then
			NewColumn = Form.Items.Insert(Attr.PredefinedDataName, Type("FormField"), Form.Items[ListName], Form.Items[PlaceInFront]);
		Else
			NewColumn = Form.Items.Add(Attr.PredefinedDataName, Type("FormField"), Form.Items[ListName]);
		EndIf;
		
		If StrFind(AttrPresentation, " ") = 0 Then
			NewColumn.DataPath = "List.Ref." + AttrPresentation;
		Else
			NewColumn.DataPath = "List.Ref.[" + AttrPresentation +"]";
		EndIf;
		
		NewColumn.Title = AttrPresentation;
		NewColumn.Visible = True;
	EndDo;
Endprocedure

Function GetSystemAttributes(MetadataFullName) Export
	Query = New Query();
	Query.Text = 
	"SELECT
	|	SystemAttributesSets.Ref
	|FROM
	|	Catalog.SystemAttributesSets AS SystemAttributesSets
	|WHERE
	|	SystemAttributesSets.PredefinedDataName = &PredefinedDataName
	|	AND NOT SystemAttributesSets.DeletionMark";
	Query.SetParameter("PredefinedDataName", StrReplace(MetadataFullName, ".", "_"));
	Try // temp
		QueryResult = Query.Execute();
	Except
		Return New Array();
	EndTry;
	QueryTable = QueryResult.Unload();
	
	ArrayOfAttributes = New Array();
	
	If QueryTable.Count() = 1 Then
		For Each Row In QueryTable[0].Ref.Attributes Do
			ArrayOfAttributes.Add(Row.Attribute);
		EndDo;
	EndIf;
	
	Return ArrayOfAttributes;
EndFunction
